In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [9]:
data = { "name" : ["a","b","c","d","a","c"], "eng" : [8,7,5,8,8,5], "hin" : [2,3,4,5,2,4]}

In [10]:
df = pd.DataFrame(data)
df

  name  eng  hin
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5
4    a    8    2
5    c    5    4

In [11]:
df["Duplicate"] = df.duplicated()
df

  name  eng  hin  Duplicate
0    a    8    2      False
1    b    7    3      False
2    c    5    4      False
3    d    8    5      False
4    a    8    2       True
5    c    5    4       True

In [14]:
df.drop(columns=["Duplicate"], inplace=True)
df

  name  eng  hin
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5
4    a    8    2
5    c    5    4

In [15]:
df.drop_duplicates(inplace=True)

In [16]:
df

  name  eng  hin
0    a    8    2
1    b    7    3
2    c    5    4
3    d    8    5

In [17]:
# Removing Duplicate on Big Data

In [18]:
dataset = pd.read_csv(r"D:\Codebase\Python\Data Cleaning\Data Clening Concepts\loan_data.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,NaN,360.0,1.0,Rural,N
1,LP001005,Male,Yes,0,Graduate,Yes,3000,NaN,66.0,360.0,1.0,Urban,Y
2,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y

In [19]:
dataset['CoapplicantIncome'].fillna(dataset['CoapplicantIncome'].mean(), inplace=True)

C:\Users\vadik\AppData\Local\Temp\ipykernel_17844\2117298730.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['CoapplicantIncome'].fillna(dataset['CoapplicantIncome'].mean(), inplace=True)

In [20]:
dataset.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
376    False
377    False
378    False
379    False
380    False
Length: 381, dtype: bool

In [21]:
dataset.shape

(381, 13)

In [22]:
dataset.drop_duplicates(inplace=True)

In [23]:
dataset.shape

(381, 13)